In [122]:
import pandas as pd
import numpy as np

In [123]:
df=pd.read_csv("C:\\Users\\Welcome\\Documents\\sidd.csv")

In [124]:
df

     Customer Id   Genre  Age  Annual Income  Spending Score
0              1    MALE   40         744457          418578
1              2  FEMALE   51         310766          253481
2              3  FEMALE   36         356570          152751
3              4    MALE   29         993854          100938
4              5  FEMALE   46         867645          336477
..           ...     ...  ...            ...             ...
195          196    MALE   35         543576          229287
196          197    MALE   37         498510          421319
197          198    MALE   52         375968          203188
198          199    MALE   42         867428           72985
199          200    MALE   43         828925          215960

[200 rows x 5 columns]

In [125]:
df.isnull()

     Customer Id  Genre    Age  Annual Income  Spending Score
0          False  False  False          False           False
1          False  False  False          False           False
2          False  False  False          False           False
3          False  False  False          False           False
4          False  False  False          False           False
..           ...    ...    ...            ...             ...
195        False  False  False          False           False
196        False  False  False          False           False
197        False  False  False          False           False
198        False  False  False          False           False
199        False  False  False          False           False

[200 rows x 5 columns]

In [126]:
df.mean()

C:\Users\Welcome\AppData\Local\Temp\ipykernel_3100\3698961737.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.mean()

Customer Id          100.500
Age                   41.665
Annual Income     672609.980
Spending Score    285371.985
dtype: float64

In [127]:
df.loc[:,'Age'].mean()

41.665

In [128]:
df.median()

C:\Users\Welcome\AppData\Local\Temp\ipykernel_3100\530051474.py:1: FutureWarning: The default value of numeric_only in DataFrame.median is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.median()

Customer Id          100.5
Age                   41.0
Annual Income     701707.0
Spending Score    292260.0
dtype: float64

In [129]:
df.mode()

     Customer Id Genre   Age  Annual Income  Spending Score
0              1  MALE  40.0         302277           30028
1              2   NaN   NaN         310766           35933
2              3   NaN   NaN         313614           42866
3              4   NaN   NaN         316362           43319
4              5   NaN   NaN         322592           43919
..           ...   ...   ...            ...             ...
195          196   NaN   NaN         976899          492040
196          197   NaN   NaN         985875          492844
197          198   NaN   NaN         986564          493593
198          199   NaN   NaN         988241          497606
199          200   NaN   NaN         993854          497844

[200 rows x 5 columns]

In [130]:
df.min()

Customer Id            1
Genre             FEMALE
Age                   25
Annual Income     302277
Spending Score     30028
dtype: object

In [131]:
df.max()

Customer Id          200
Genre               MALE
Age                   60
Annual Income     993854
Spending Score    497844
dtype: object

In [132]:
df.std()

C:\Users\Welcome\AppData\Local\Temp\ipykernel_3100\3390915376.py:1: FutureWarning: The default value of numeric_only in DataFrame.std is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.std()

Customer Id           57.879185
Age                    9.867605
Annual Income     200901.298379
Spending Score    136409.447747
dtype: float64

In [133]:
df.std(axis=1)[0:4]

C:\Users\Welcome\AppData\Local\Temp\ipykernel_3100\3966588610.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.std(axis=1)[0:4]

0    361126.627418
1    164539.259978
2    168931.082403
3    482449.931378
dtype: float64